// -----------------------------------------------------------------------------
#ifndef __SSS_FLCNST__
// -----------------------------------------------------------------------------
#define __SSS_FLCNST__
// -----------------------------------------------------------------------------
// Команды
// -----------------------------------------------------------------------------
// Установка текущей страницы (извне)
#define FLASH_CMD_SET_CURPAGE       1
// -----------------------------------------------------------------------------
// Получение списка файлов
#define FLASH_CMD_GET_FILES         2
// -----------------------------------------------------------------------------
// Получение информации о файлах
#define FLASH_CMD_GET_FILESINFO     3
// -----------------------------------------------------------------------------
// Стереть сектор
#define FLASH_CMD_ERASE_SECTOR      4
// -----------------------------------------------------------------------------
// Стереть всю флеш-память
#define FLASH_CMD_WIPE_ALL          5
// -----------------------------------------------------------------------------
// Поиск адресов (по порядку) указанного файла
#define FLASH_CMD_FINDFILEPAGES     6
// -----------------------------------------------------------------------------
// Стирание файла по указанному индексу
#define FLASH_CMD_ERASE_FILE        7
// -----------------------------------------------------------------------------
// Показ битмапа на экране по FileID
#define FLASH_CMD_SHOW_BITMAP       8
// -----------------------------------------------------------------------------
// Получение информации об использовании массива памяти
#define FLASH_CMD_GET_MEMINFO       9
// -----------------------------------------------------------------------------
// Проиграть звуковой файл по его ID
#define FLASH_CMD_PLAY_SND          10
// -----------------------------------------------------------------------------
// Проиграть тестовый звуковой файл из RAM
#define FLASH_CMD_PLAY_TEST_SND     11
// -----------------------------------------------------------------------------
// Получить указанную страницу указанного файла по ID
#define FLASH_CMD_GET_FDBYID        12
// -----------------------------------------------------------------------------
// Проверка файла на существование
#define FLASH_CMD_GET_FILEEXISTSID  13
// -----------------------------------------------------------------------------
// Запрос на стирание указанного сегмента указанного файла
#define FLASH_CMD_HIDE_FILESEGMENT  14
// -----------------------------------------------------------------------------
// Запрос на поиск пустого места в непрерывной области
#define FLASH_CMD_FINDCONTPLACE     15
// -----------------------------------------------------------------------------
// Запрос на установку счетчика адреса непрерывной записи
#define FLASH_CMD_SETWRITEADDR      16
// -----------------------------------------------------------------------------
// Запрос на очистку всей области непрерывной памяти
#define FLASH_CMD_WIPE_CONTAREA     17
// -----------------------------------------------------------------------------
// Проиграть звук из непрерывной области
#define FLASH_CMD_PLAY_CONTSND      18
// -----------------------------------------------------------------------------
// Установка громкости [0..100]
#define FLASH_CMD_PLAY_VOLUME       19
// -----------------------------------------------------------------------------
// Получить свойства указанного файла (по ID)
#define FLASH_CMD_FILE_PROP         20
// -----------------------------------------------------------------------------
// Установить новый адрес начала ПУСТОГО пространства непрерывной области
#define FLASH_CMD_SETNEW_FREECONTAREA 21
// -----------------------------------------------------------------------------
// Сделать генеральную уборку массива памяти
#define FLASH_CMD_GO_GCC            0xFF00
// -----------------------------------------------------------------------------
// Перезагрузка системы
#define FLASH_CMD_SYS_REBOOT        0xFFFE
// -----------------------------------------------------------------------------
// Пакеты
// -----------------------------------------------------------------------------
// Пакет содержит данные файлов
#define FLASH_PACK_FILEINFO         1
// -----------------------------------------------------------------------------
// Пакет содержит данные одной из страниц флеш памяти
#define FLASH_PACK_PAGEDATA         2
// -----------------------------------------------------------------------------
// Пакет содержит часть данных карты файла
#define FLASH_PACK_MAPDATA          3
// -----------------------------------------------------------------------------
// Пакет содержит информацию о занимаемой памяти
#define FLASH_PACK_MEMINFO          4
// -----------------------------------------------------------------------------
// Пакет содержит информацию о файле в непрерывной области
#define FLASH_PACK_FILECONTINFO     5
// -----------------------------------------------------------------------------
// Пакет содержит информацию об одиночной файле в протокольной области
#define FLASH_PACK_SINGLEFILEINFO   6
// -----------------------------------------------------------------------------
// Статусы
// -----------------------------------------------------------------------------
// Нераспознанная команда
#define FLASH_STATE_BAD_COMMAND         255
// -----------------------------------------------------------------------------
// Общий код успешности последней операции
#define FLASH_STATE_CMD_OK              0
// -----------------------------------------------------------------------------
// Система перезагружается
#define FLASH_STATE_GO_REBOOT_NOW       254
// -----------------------------------------------------------------------------
// Окончание передачи имен файлов
#define FLASH_STATE_FILEINFO_DONE       230
// -----------------------------------------------------------------------------
// Окончание передачи имен файлов с ошибкой
#define FLASH_STATE_FILEINFO_ERR        130
// -----------------------------------------------------------------------------
// Чтение страницы провалилось
#define FLASH_STATE_RDPAGE_FAILED       120
// -----------------------------------------------------------------------------
// Запись страницы завершилась успешно
#define FLASH_STATE_WRPAGE_OK           231
// -----------------------------------------------------------------------------
// Запись страницы провалилась
#define FLASH_STATE_WRPAGE_FAILED       131
// -----------------------------------------------------------------------------
// Удаление файла произошло успешно
#define FLASH_STATE_DELFILE_OK          235
// -----------------------------------------------------------------------------
// Проигрываение звукового файла зевершено
#define FLASH_STATE_PLAYSND_OK          236
// -----------------------------------------------------------------------------
// Файл с указанным ID не найден
#define FLASH_STATE_FILE_NOFOUND        137
// -----------------------------------------------------------------------------
// Файл с указанным ID существует
#define FLASH_STATE_FILE_EXISTS         237
// -----------------------------------------------------------------------------
// Ошибка удаления сегмента файла
#define FLASH_STATE_HFS_FAILED          138
// -----------------------------------------------------------------------------
// Успешное удаление сегмента файла для его замещения новой версией
#define FLASH_STATE_HFS_OK              238
// -----------------------------------------------------------------------------
// Удаление файла произошло успешно
#define FLASH_STATE_DELFILE_FAILED      135
// -----------------------------------------------------------------------------
// Ошибка получения данных о файле (файл не существует?)
#define FLASH_STATE_FILEINFO_FAILED     143
// -----------------------------------------------------------------------------
// Окончание полной очистки флешки
#define FLASH_STATE_WIPEALL_DONE        232
// -----------------------------------------------------------------------------
// Окончание поиска страниц указанного файла
#define FLASH_STATE_MAPDATA_DONE        233
// -----------------------------------------------------------------------------
// Ошибка при поиске страниц указанного файла
#define FLASH_STATE_MAPDATA_ERR         133
// -----------------------------------------------------------------------------
// Ошибка получения данных о памяти
#define FLASH_STATE_MEMINFO_FAILED      135
// -----------------------------------------------------------------------------
// Очистка массива памяти завершена
#define FLASH_STATE_GCC_COMPLETE        241
// -----------------------------------------------------------------------------
// Очистка массива непрерывной памяти завершена
#define FLASH_STATE_ERASE_CONTMEM_OK    242
// -----------------------------------------------------------------------------
// Непрерывная область полна или недействительна
#define FLASH_STATE_CONTAREA_FULL       136
// -----------------------------------------------------------------------------
// Статусы запроса установки адреса страницы для непрерывной записи файла
#define FLASH_STATE_SETWRITEADDR_OK     239
#define FLASH_STATE_SETWRITEADDR_FAILED 139
// -----------------------------------------------------------------------------
// Запись по указанному адресу невозможна!
#define FLASH_STATE_WRITECONTADDR_FAILED 140
// Запись в непрерывную область успешно завершена
#define FLASH_STATE_WRITECONTADDR_OK    240
// -----------------------------------------------------------------------------
// Статусы по команде установки нового адреса свободной части непрерывной области
#define FLASH_STATE_SET_FREECONTAREA_OK 243
#define FLASH_STATE_SET_FREECONTAREA_FAILED 144
// -----------------------------------------------------------------------------
#endif
// -----------------------------------------------------------------------------